# Дана строка
import re

# emails_str = 'По всем вопросам пишите на email zhannss.09@gmail.com либо email организации smile@brunoyam.com'
#
# red_exp = r'[\w\.-]+@[\w\.-]+'
#
# emails = re.findall(red_exp, emails_str)
#
# for email in emails:
#     print(email)



# Нужно вывести только те строки, где 'кот' это отдельное слово

# cats_list = [
#     'кот в сапогах',
#     'кошка и кот',
#     'котофей',
#     'котяра'
# ]
#
# reg_exp = r'\bкот\b'
#
# for cat in cats_list:
#     if re.search(reg_exp, cat):
#         print(cat)
#
